package datafactory;

import java.io.BufferedReader;
import java.io.FileInputStream;
import java.io.InputStreamReader;
import java.net.InetAddress;
import java.net.UnknownHostException;

public class test {
	public static void main(String[] args){
		try {
			System.out.println(InetAddress.getLocalHost()
					.getHostAddress().toString());
		} catch (UnknownHostException e) {
			// TODO Auto-generated catch block
			e.printStackTrace();
		}
//		DataFactory.getallPlyayer();
		DataFactory.getallmatches();
//		String test = "14-15;洛杉矶湖人;35;35;34.5;37.3%;7.6;20.4;29.3%;1.5;5.3;81.3%;5.6;6.9;5.7;0.7;4.9;5.6;1.3;0.2;3.7;1.9;22.3;10;25;35;35;1206;37.3%;266;713;29.3%;54;184;81.3%;196;241;199;26;173;197;47;7;128;65;782;10;25;9.1%;2.3%;16.4%;29.7%;2.0%;0.5%;13.5%;34.7%;96;111;0.1;-0.4;0.5;17.5;7;18;27;15.7;56.7%;1.6;2.8;13.6%;38.0%;1.0;2.6;12.9%;31.1%;1.2;3.8;18.5%;38.9%;2.3;5.9;29.2%;47.7%;41.1%;";
//		String test = "80-81;西雅图超音速;47; ;12.9;47.3%;0.9;2.0; ;0.0;0.0;70.0%;0.3;0.4;2.3;0.7;1.6;1.1;0.3;0.2;0.7;1.8;2.2;47; ;607;47.3%;44;93; ;0;0;70.0%;14;20;108;33;75;54;12;8;33;85;102;9.8%;6.1%;13.3%;11.5%;0.9%;0.7%;24.5%;9.0%;98;106;0.6;0.0;0.6;6.7; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ;50.1%;47.3%;;";
//		String test = "73-74;印第安纳老者(ABA);20; ;7.5;50.0%;1.2;2.4;100.0%;0.1;0.1;77.8%;0.4;0.5;1.0;0.5;0.5;0.2;0.2;0.1;0.4;0.6;2.8;20; ;149;50.0%;24;48;100.0%;1;1;77.8%;7;9;20;10;10;3;3;2;8;11;56;6.3%;6.4%;6.3%;2.8%;0.9%;0.7%;13.3%;15.7%;105;105;0.3;0.2;0.1;11.2; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ; ;53.9%;51.0%;";
//		String[] data = test.split(";");
//		System.out.println(data[32]+"  "+data[33]+"  "+data[6]+"   "+data.length);
//		
//		String test1 = "68-69;总计(ABA);62; ;22.6;45.5%;3.5;7.8; ;0.0;0.0;79.2%;1.9;2.4;7.4;3.0;4.4;1.1; ; ;1.3;2.8;9.0;25; ;27.1;43.3%;4.0;9.3; ;0.0;0.0;82.4%;3.0;3.6;8.7;3.2;5.5;1.4; ; ;1.7;3.3;11.1; ;43;83;277;67-68;新泽西美洲人(ABA);78; ;2626;49.4%;463;938; ;0;0;69.7%;223; ; ; ; ; ; ; ; ; ; ; ; ;68-69;肯塔基上校; ; ; ; ; ;";
//		String[] data1 = test1.split(";");
//		System.out.println(data1[25]+"  "+data1[30]+"  "+data1[30]+data.length);
		
	}
}
